Revit 2027 API
ExportLayerTable.GetLayerTableIterator Method
Returns a LayerTableIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLayerTableIterator GetLayerTableIterator()
Public Function GetLayerTableIterator As ExportLayerTableIterator
public:
ExportLayerTableIterator^ GetLayerTableIterator()
member GetLayerTableIterator : unit -> ExportLayerTableIterator
Return Value
ExportLayerTableIterator
A LayerTableIterator object that can be used to iterate through key-value pairs in the collection.
See Also
Reference
ExportLayerTable Class
Autodesk.Revit.DB Namespace